import Education from "./Education";
import Experience from "./Experience";
import { LawyerProps } from "@/app/types/types";
import React from "react";
import Skills from "./Skills";
import Text from "@/components/Text";
import Title from "@/components/Title";

const education = [
  {
    id: 1,
    title:
      "کارشناسی ارشد حقوق خصوصی از دانشکده حقوق و علوم سیاسی دانشگاه تهران",
    time: "فارغ التحصیل در 20 تیر 1390",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی",
  },
  {
    id: 2,
    title: "دکترا حقوق خصوصی از دانشکده حقوق و علوم سیاسی دانشگاه تهران",
    time: "فارغ التحصیل در 20 تیر 1395",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنید  ",
  },
];

const experiences = [
  {
    id: 1,
    title: "وکیل پایه یک دادگستری",
    time: "از سال 1391",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی    ",
  },
  {
    id: 2,
    title: "عضو کانون وکلای دادگستری اصفهان",
    time: "از سال 1393",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی",
  },
  {
    id: 3,
    title: "سابقه عضویت هیات علمی و مدیریت گروه حقوق دانشگاه از سال ۱۳۹۵",
    time: "از سال 1393",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی",
  },
  {
    id: 4,
    title:
      "مؤلف کتاب «شروط داوری در اساسنامه شرکت های تجاری» تحت اشراف و راهنمایی سرکار خانم دکتر لعیا جنیدی معاونت محترم حقوقی ریاست جمهوری",
    time: "سال 1396",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی",
  },
  {
    id: 5,
    title: "استاد راهنما و مشاور در پایان نامه های دانشجویی مقطع فوق لیسانس",
    time: "سال 1396-1398",
    info: "دانش آموخته حقوق در محضر اساتیدی همچون دکتر امیر ناصر کاتوزیان، دکتر سید حسین صفایی، دکتر نجادعلی الماسی، دکتر محمود عرفانی، دکتر عباس کریمی، دکتر لعیا جنیدی",
  },
];

const LawyerBio = ({ lawyer }: { lawyer: LawyerProps | any }) => {
  return (
    <div className="p-5">
      <Title className="mt-4" smaller title="درباره من" />
      <Text
        className="mt-4 mb-8 max-w-3xl"
        text="وکیل پایه یک دادگستری در اصفهان عضو اتحادیه سراسری کانون های وکلای دادگستری ایران (اسکودا) آماده پذیرش انواع دعاوی حقوقی | دعاوی خانواده | دعاوی ثبتی | دعاوی کیفری میباشد. جهت رزرو نوبت مشاوره از طریق شماره های درج شده در سایت نسبت به اخذ نوبت حضوری یا غیر حضوری (تلفنی) اقدام فرمایید"
      />
      <Education educations={education} />
      <Experience experiences={experiences} />
      <Skills lawyer={lawyer} />
    </div>
  );
};

export default LawyerBio;
